# Day 1 challange Pandas

### Part one Describing Data using Attribute and Functions

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv(r'E:\2023\Udemy - Complete Machine Learning & Data Science Bootcamp 2023\6 - Pandas Data Analysis\49 - car-sales.csv')

In [3]:
data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [4]:
data.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [5]:
data.index

RangeIndex(start=0, stop=10, step=1)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

The .info() method returns a DataFrame that contains information about the DataFrame, such as the number of rows and columns, the data types of the columns, and the memory usage.

In [7]:
data.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [8]:
len(data.columns) # The len() function returns the length of a list, string, or tuple.

5

In [9]:
data.index

RangeIndex(start=0, stop=10, step=1)

In [10]:
data.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

describe() - This method prints a summary of the DataFrame, such as the mean, median, and standard deviation of each column.

In [11]:
data["Doors"].sum()

40

In [12]:
data["Doors"].mean()

4.0

In [13]:
data["Doors"].max()

5

In [14]:
data["Doors"].min()

3

## Selecting and Viewing Data with Pandas

### 1 .head() - 
This method returns the first n rows of the DataFrame.

In [15]:
data.head() # by defualt return 5 elements

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [16]:
data.head(6)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00

### 2.tail() 
- This method returns the last n rows of the DataFrame.

In [17]:
data.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

loc: This method selects rows and columns by index or label.

In [18]:
data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [19]:
data.nunique()

Make              4
Colour            5
Odometer (KM)    10
Doors             3
Price             9
dtype: int64

The nunique function also takes a list as input and returns the number of unique values in the input list. For example, if you have a list of numbers [1, 2, 3, 1, 2, 4], the nunique function would return 4.

In [20]:
data["Colour"].unique()

array(['White', 'Red', 'Blue', 'Black', 'Green'], dtype=object)

In [21]:
data.loc[2 ] # refers to  index

Make                Toyota
Colour                Blue
Odometer (KM)        32549
Doors                    3
Price            $7,000.00
Name: 2, dtype: object

iloc: This method selects rows and columns by positin.

In [22]:
data.iloc[8,] # refers to position

Make                Toyota
Colour               White
Odometer (KM)        60000
Doors                    4
Price            $6,250.00
Name: 8, dtype: object

In [23]:
data["Odometer (KM)"]

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [24]:
data["Doors"]

0    4
1    4
2    3
3    5
4    4
5    4
6    4
7    4
8    4
9    4
Name: Doors, dtype: int64

In [25]:
data.Doors

0    4
1    4
2    3
3    5
4    4
5    4
6    4
7    4
8    4
9    4
Name: Doors, dtype: int64

### Boolean Indexing

In [26]:
data[data["Make"]== "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [34]:
data["Price"] = data["Price"].replace('[\$\,\.\*]', '').astype(int)

Price column object to int in pandas

In [36]:
data["Price"]

0     4000
1     5000
2     7000
3    22000
4     3500
5     4500
6     7500
7     7000
8     6250
9     9700
Name: Price, dtype: int32